Revit 2024 API
Field.ContainerType Property
 Reports whether this is a simple field containing one value, or a container of multiple values.
Namespace: Autodesk.Revit.DB.ExtensibleStorage
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2012
Syntax
C#
public ContainerType ContainerType { get; }
Visual Basic
Public ReadOnly Property ContainerType As ContainerType
	Get
Visual C++
public:
property ContainerType ContainerType {
	ContainerType get ();
}
See Also
Field Class
Autodesk.Revit.DB.ExtensibleStorage Namespace